#### Terraform Plan
```

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.agent_lambda.aws_cloudwatch_log_group.agent will be created
  + resource "aws_cloudwatch_log_group" "agent" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/lambda/trip-assistant-agent"
      + name_prefix       = (known after apply)
      + retention_in_days = 7
      + skip_destroy      = false
      + tags              = {
          + "Environment" = "dev"
          + "Project"     = "trip-assistant"
        }
      + tags_all          = {
          + "Environment" = "dev"
          + "Project"     = "trip-assistant"
        }
    }

  # module.agent_lambda.aws_iam_role.lambda will be created
  + resource "aws_iam_role" "lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "trip-assistant-agent-dev-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Environment" = "dev"
          + "Project"     = "trip-assistant"
        }
      + tags_all              = {
          + "Environment" = "dev"
          + "Project"     = "trip-assistant"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.agent_lambda.aws_iam_role_policy.ssm_read will be created
  + resource "aws_iam_role_policy" "ssm_read" {
      + id          = (known after apply)
      + name        = "trip-assistant-agent-dev-ssm"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = (known after apply)
    }

  # module.agent_lambda.aws_iam_role_policy_attachment.lambda_basic will be created
  + resource "aws_iam_role_policy_attachment" "lambda_basic" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole"
      + role       = "trip-assistant-agent-dev-role"
    }

  # module.agent_lambda.aws_lambda_alias.env will be created
  + resource "aws_lambda_alias" "env" {
      + arn              = (known after apply)
      + function_name    = "trip-assistant-agent"
      + function_version = (known after apply)
      + id               = (known after apply)
      + invoke_arn       = (known after apply)
      + name             = "dev"
    }

  # module.agent_lambda.aws_lambda_function.agent will be created
  + resource "aws_lambda_function" "agent" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + function_name                  = "trip-assistant-agent"
      + id                             = (known after apply)
      + image_uri                      = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 512
      + package_type                   = "Image"
      + publish                        = true
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags                           = {
          + "Environment" = "dev"
          + "Project"     = "trip-assistant"
        }
      + tags_all                       = {
          + "Environment" = "dev"
          + "Project"     = "trip-assistant"
        }
      + timeout                        = 30
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "ENVIRONMENT"        = "dev"
              + "SSM_PARAMETER_NAME" = "/trip-assistant/dev/openai-api-key"
            }
        }

      + ephemeral_storage (known after apply)

      + logging_config (known after apply)

      + tracing_config (known after apply)
    }

  # module.api_gateway.aws_apigatewayv2_api.api will be created
  + resource "aws_apigatewayv2_api" "api" {
      + api_endpoint                 = (known after apply)
      + api_key_selection_expression = "$request.header.x-api-key"
      + arn                          = (known after apply)
      + execution_arn                = (known after apply)
      + id                           = (known after apply)
      + ip_address_type              = (known after apply)
      + name                         = "trip-assistant-dev"
      + protocol_type                = "HTTP"
      + route_selection_expression   = "$request.method $request.path"
      + tags                         = {
          + "Environment" = "dev"
          + "Project"     = "trip-assistant"
        }
      + tags_all                     = {
          + "Environment" = "dev"
          + "Project"     = "trip-assistant"
        }

      + cors_configuration {
          + allow_headers = [
              + "Content-Type",
            ]
          + allow_methods = [
              + "GET",
              + "OPTIONS",
              + "POST",
            ]
          + allow_origins = [
              + "*",
            ]
          + max_age       = 300
        }
    }

  # module.api_gateway.aws_apigatewayv2_integration.lambda will be created
  + resource "aws_apigatewayv2_integration" "lambda" {
      + api_id                                    = (known after apply)
      + connection_type                           = "INTERNET"
      + id                                        = (known after apply)
      + integration_method                        = "POST"
      + integration_response_selection_expression = (known after apply)
      + integration_type                          = "AWS_PROXY"
      + integration_uri                           = (known after apply)
      + payload_format_version                    = "2.0"
      + timeout_milliseconds                      = (known after apply)
    }

  # module.api_gateway.aws_apigatewayv2_route.default will be created
  + resource "aws_apigatewayv2_route" "default" {
      + api_id             = (known after apply)
      + api_key_required   = false
      + authorization_type = "NONE"
      + id                 = (known after apply)
      + route_key          = "$default"
      + target             = (known after apply)
    }

  # module.api_gateway.aws_apigatewayv2_stage.default will be created
  + resource "aws_apigatewayv2_stage" "default" {
      + api_id        = (known after apply)
      + arn           = (known after apply)
      + auto_deploy   = true
      + deployment_id = (known after apply)
      + execution_arn = (known after apply)
      + id            = (known after apply)
      + invoke_url    = (known after apply)
      + name          = "$default"
      + tags          = {
          + "Environment" = "dev"
          + "Project"     = "trip-assistant"
        }
      + tags_all      = {
          + "Environment" = "dev"
          + "Project"     = "trip-assistant"
        }
    }

  # module.api_gateway.aws_lambda_permission.api_gateway will be created
  + resource "aws_lambda_permission" "api_gateway" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "trip-assistant-api"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + qualifier           = "dev"
      + source_arn          = (known after apply)
      + statement_id        = "AllowAPIGatewayInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.api_lambda.aws_cloudwatch_log_group.api will be created
  + resource "aws_cloudwatch_log_group" "api" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/lambda/trip-assistant-api"
      + name_prefix       = (known after apply)
      + retention_in_days = 7
      + skip_destroy      = false
      + tags              = {
          + "Environment" = "dev"
          + "Project"     = "trip-assistant"
        }
      + tags_all          = {
          + "Environment" = "dev"
          + "Project"     = "trip-assistant"
        }
    }

  # module.api_lambda.aws_iam_role.lambda will be created
  + resource "aws_iam_role" "lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "trip-assistant-api-dev-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Environment" = "dev"
          + "Project"     = "trip-assistant"
        }
      + tags_all              = {
          + "Environment" = "dev"
          + "Project"     = "trip-assistant"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.api_lambda.aws_iam_role_policy.invoke_agent will be created
  + resource "aws_iam_role_policy" "invoke_agent" {
      + id          = (known after apply)
      + name        = "trip-assistant-api-dev-invoke-agent"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = (known after apply)
    }

  # module.api_lambda.aws_iam_role_policy_attachment.lambda_basic will be created
  + resource "aws_iam_role_policy_attachment" "lambda_basic" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole"
      + role       = "trip-assistant-api-dev-role"
    }

  # module.api_lambda.aws_lambda_alias.env will be created
  + resource "aws_lambda_alias" "env" {
      + arn              = (known after apply)
      + function_name    = "trip-assistant-api"
      + function_version = (known after apply)
      + id               = (known after apply)
      + invoke_arn       = (known after apply)
      + name             = "dev"
    }

  # module.api_lambda.aws_lambda_function.api will be created
  + resource "aws_lambda_function" "api" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + function_name                  = "trip-assistant-api"
      + id                             = (known after apply)
      + image_uri                      = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 512
      + package_type                   = "Image"
      + publish                        = true
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags                           = {
          + "Environment" = "dev"
          + "Project"     = "trip-assistant"
        }
      + tags_all                       = {
          + "Environment" = "dev"
          + "Project"     = "trip-assistant"
        }
      + timeout                        = 30
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "AGENT_LAMBDA_FUNCTION_NAME"     = "trip-assistant-agent:dev"
              + "AWS_LAMBDA_EXEC_WRAPPER_REGION" = "us-east-2"
              + "ENVIRONMENT"                    = "dev"
            }
        }

      + ephemeral_storage (known after apply)

      + logging_config (known after apply)

      + tracing_config (known after apply)
    }

  # module.ecr.aws_ecr_lifecycle_policy.agent will be created
  + resource "aws_ecr_lifecycle_policy" "agent" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + rules = [
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "Keep last 2 images"
                      + rulePriority = 1
                      + selection    = {
                          + countNumber = 2
                          + countType   = "imageCountMoreThan"
                          + tagStatus   = "any"
                        }
                    },
                ]
            }
        )
      + registry_id = (known after apply)
      + repository  = "trip-assistant-agent"
    }

  # module.ecr.aws_ecr_lifecycle_policy.api will be created
  + resource "aws_ecr_lifecycle_policy" "api" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + rules = [
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "Keep last 2 images"
                      + rulePriority = 1
                      + selection    = {
                          + countNumber = 2
                          + countType   = "imageCountMoreThan"
                          + tagStatus   = "any"
                        }
                    },
                ]
            }
        )
      + registry_id = (known after apply)
      + repository  = "trip-assistant-api"
    }

  # module.ecr.aws_ecr_repository.agent will be created
  + resource "aws_ecr_repository" "agent" {
      + arn                  = (known after apply)
      + force_delete         = true
      + id                   = (known after apply)
      + image_tag_mutability = "IMMUTABLE"
      + name                 = "trip-assistant-agent"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags                 = {
          + "Project" = "trip-assistant"
          + "Service" = "agent"
        }
      + tags_all             = {
          + "Project" = "trip-assistant"
          + "Service" = "agent"
        }

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

  # module.ecr.aws_ecr_repository.api will be created
  + resource "aws_ecr_repository" "api" {
      + arn                  = (known after apply)
      + force_delete         = true
      + id                   = (known after apply)
      + image_tag_mutability = "IMMUTABLE"
      + name                 = "trip-assistant-api"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags                 = {
          + "Project" = "trip-assistant"
          + "Service" = "api"
        }
      + tags_all             = {
          + "Project" = "trip-assistant"
          + "Service" = "api"
        }

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

  # module.github_oidc.aws_iam_openid_connect_provider.github will be created
  + resource "aws_iam_openid_connect_provider" "github" {
      + arn             = (known after apply)
      + client_id_list  = [
          + "sts.amazonaws.com",
        ]
      + id              = (known after apply)
      + tags            = {
          + "Environment" = "dev"
          + "Project"     = "trip-assistant"
        }
      + tags_all        = {
          + "Environment" = "dev"
          + "Project"     = "trip-assistant"
        }
      + thumbprint_list = [
          + "6938fd4d98bab03faadb97b34396831e3780aea1",
        ]
      + url             = "https://token.actions.githubusercontent.com"
    }

  # module.github_oidc.aws_iam_role.github_actions will be created
  + resource "aws_iam_role" "github_actions" {
      + arn                   = (known after apply)
      + assume_role_policy    = (known after apply)
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "trip-assistant-github-actions-dev"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Environment" = "dev"
          + "Project"     = "trip-assistant"
        }
      + tags_all              = {
          + "Environment" = "dev"
          + "Project"     = "trip-assistant"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.github_oidc.aws_iam_role_policy.ecr_push will be created
  + resource "aws_iam_role_policy" "ecr_push" {
      + id          = (known after apply)
      + name        = "trip-assistant-ecr-push-dev"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = (known after apply)
    }

  # module.github_oidc.aws_iam_role_policy.lambda_deploy will be created
  + resource "aws_iam_role_policy" "lambda_deploy" {
      + id          = (known after apply)
      + name        = "trip-assistant-lambda-deploy-dev"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = (known after apply)
    }

  # module.ssm.aws_ssm_parameter.openai_api_key will be created
  + resource "aws_ssm_parameter" "openai_api_key" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + description    = "OpenAI API key for the trip assistant agent"
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/trip-assistant/dev/openai-api-key"
      + tags           = {
          + "Environment" = "dev"
          + "Project"     = "trip-assistant"
        }
      + tags_all       = {
          + "Environment" = "dev"
          + "Project"     = "trip-assistant"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + value_wo       = (write-only attribute)
      + version        = (known after apply)
    }

Plan: 26 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + agent_ecr_repository_url   = (known after apply)
  + agent_lambda_function_name = "trip-assistant-agent"
  + api_ecr_repository_url     = (known after apply)
  + api_lambda_function_name   = "trip-assistant-api"
  + api_url                    = (known after apply)
  + github_actions_role_arn    = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
*Triggered by @OsherKoren on `feature/infra`*